Revit 2027 API
Rebar.GetOverridableCrankParameters Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarCrankOverridableParameters GetOverridableCrankParameters()
Public Function GetOverridableCrankParameters As RebarCrankOverridableParameters
public:
RebarCrankOverridableParameters^ GetOverridableCrankParameters()
member GetOverridableCrankParameters : unit -> RebarCrankOverridableParameters
Return Value
RebarCrankOverridableParameters
 Returns the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace